#+TITLE: February 19-28, 2019 (10 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                             | CANCELED |
|------+------+-------------+---------+------------------------------------------------------------------+----------|
|      |      |             |         | READ.1550764743. Django Project Optimization (2019-03-26)        |          |
|      |      |             |         | WRITE.1550819723. Blog Writing (2019-03-23)                      |          |
|      |      |             |         | OPS.1549821237. GNU Emacs bug triaging (2019-02-28)              |          |
|      |      |             |         | READ.1548140097. NIOS Maths Text Book - Part I (2019-02-28)      |          |
|      |      |             |         | DEV.1550564523. [#A] Understanding the concept of R (2019-02-28) |          |
|      |      |             |         | READ.1550682829. Chapter 12. Reflection (2019-02-27)             |          |
|      |      |             |         | WRITE.1549821271. Write blog post about Emacs (2019-02-19)       |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME             | ESTIMATED |             ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|------------------+-----------+--------------------+------+-----------+--------------+------------|
| Sandeepk         |         8 |                7.2 |    8 |         0 |   2019-03-10 | ########## |
| Nightwarrior-Xxx |        19 |               2.92 |   19 |         0 |   2019-03-10 | ########## |
| Jasonbraganza    |      50.0 |              14.33 | 50.0 |         0 |   2019-03-10 | ########## |
| Bhavin192        |      2.75 | 3.1799999999999997 | 2.75 |         0 |   2019-03-10 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  80 +---------------------------------------------------------------------+   
:     |      #########################################################      |   
:  70 |+     ......                                          ACTUAL #######+|   
:     |            .                                          IDEAL ....... |   
:  60 |+            .......                                           #    +|   
:     |                    ......                                      #    |   
:     |                          .                                     #    |   
:  50 |+                          ......                                #  +|   
:     |                                 .                               #   |   
:  40 |+                                 ......                          # +|   
:     |                                        .                         #  |   
:  30 |+                                        ......                    #+|   
:     |                                               .                   # |   
:  20 |+                                               .......             #|   
:     |                                                       ......       #|   
:     |                                                             .       |   
:  10 |+                                                             ......+|   
:     |                                                                    .|   
:   0 +---------------------------------------------------------------------+   
:     0             2             4             6             8             10  
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:10]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                               |
|-----+------------+--------+-------+-----------------------------------------------|
|   1 | 2019-02-19 |  77.75 |    72 | WRITE.1549821271                              |
|   2 | 2019-02-20 |  77.75 |    64 |                                               |
|   3 | 2019-02-21 |  77.75 |    56 |                                               |
|   4 | 2019-02-22 |  77.75 |    48 |                                               |
|   5 | 2019-02-23 |  77.75 |    40 |                                               |
|   6 | 2019-02-24 |  77.75 |    32 |                                               |
|   7 | 2019-02-25 |  77.75 |    24 |                                               |
|   8 | 2019-02-26 |  77.75 |    16 |                                               |
|   9 | 2019-02-27 |  77.25 |     8 | READ.1550682829                               |
|  10 | 2019-02-28 |    8.0 |     0 | DEV.1550564523 READ.1548140097 OPS.1549821237 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                        | TASKID           | OWNER            | PRIORITY | TODO | ESTIMATED |             ACTUAL |
|---------------------------------------------+------------------+------------------+----------+------+-----------+--------------------|
| TASKS                                       |                  |                  | B        |      |     79.75 | 27.629999999999995 |
|---------------------------------------------+------------------+------------------+----------+------+-----------+--------------------|
| bhavin192                                   |                  |                  | B        |      |      2.75 | 3.1799999999999997 |
| Learning Golang                             |                  |                  | B        |      |       0.5 |               0.43 |
| Chapter 12. Reflection                      | READ.1550682829  | bhavin192        | B        | DONE |       0.5 |               0.43 |
| GNU Emacs bug triaging                      | OPS.1549821237   | bhavin192        | B        | DONE |      0.25 |               0.18 |
| Write blog post about Emacs                 | WRITE.1549821271 | bhavin192        | B        | DONE |         2 |               2.57 |
|---------------------------------------------+------------------+------------------+----------+------+-----------+--------------------|
| jasonbraganza                               |                  |                  | B        |      |      50.0 |              14.33 |
| NIOS Maths Text Book - Part I               | READ.1548140097  | jasonbraganza    | B        | DONE |      50.0 |              14.33 |
|---------------------------------------------+------------------+------------------+----------+------+-----------+--------------------|
| sandeepk                                    |                  |                  | B        |      |         8 |                7.2 |
| Django Project Optimization                 | READ.1550764743  | sandeepk         | B        | DONE |         5 |               4.87 |
| Blog Writing                                | WRITE.1550819723 | sandeepk         | B        | DONE |         3 |               2.33 |
|---------------------------------------------+------------------+------------------+----------+------+-----------+--------------------|
| nightwarrior-xxx                            |                  |                  | B        |      |        19 |               2.92 |
| Understanding the concept of React - Part I | DEV.1550564523   | nightwarrior-xxx | A        | DONE |        19 |               2.92 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 10
  :SPRINTSTART: <2019-02-19 Tue>
  :wpd-bhavin192: 1
  :wpd-jasonbraganza: 8
  :wpd-nightwarrior-xxx: 2
  :wpd-sandeepk: 1.5
  :END:
** bhavin192
*** Learning Golang
**** DONE Chapter 12. Reflection [3/3]
     CLOSED: [2019-02-27 Wed 22:28]
     :PROPERTIES:
     :ESTIMATED: 0.5
     :ACTUAL:   0.43
     :OWNER:    bhavin192
     :ID:       READ.1550682829
     :TASKID:   READ.1550682829
     :END:
     :LOGBOOK:
     CLOCK: [2019-02-27 Wed 22:23]--[2019-02-27 Wed 22:28] =>  0:05
     CLOCK: [2019-02-27 Wed 22:19]--[2019-02-27 Wed 22:23] =>  0:04
     CLOCK: [2019-02-27 Wed 19:40]--[2019-02-27 Wed 19:57] =>  0:17
     :END:
     - [X] 12.7 Accessing Struct Field Tags      (20m)
     - [X] 12.8 Displaying the Methods of a Type (5m)
     - [X] 12.9 A Word of Caution                (10m)
*** DONE GNU Emacs bug triaging [5/5]
    CLOSED: [2019-02-28 Thu 23:31]
    :PROPERTIES:
    :ESTIMATED: 0.25
    :ACTUAL:   0.18
    :OWNER:    bhavin192
    :ID:       OPS.1549821237
    :TASKID:   OPS.1549821237
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-28 Thu 23:20]--[2019-02-28 Thu 23:31] =>  0:11
    :END:
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34268][#34268]]: wrong indentation in python mode
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34330][#34330]]: shell auto-complete cannot handle special characters
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34287][#34287]]: dired-do-rename vs. ls -R switch
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34267][#34267]]: Multiple themes in M-x customize-themes
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34397][#34397]]: completion forgets to escape "?"
*** DONE Write blog post about Emacs
    CLOSED: [2019-02-19 Tue 23:32]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   2.57
    :OWNER:    bhavin192
    :ID:       WRITE.1549821271
    :TASKID:   WRITE.1549821271
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-19 Tue 22:14]--[2019-02-19 Tue 23:32] =>  1:18
    CLOCK: [2019-02-19 Tue 19:18]--[2019-02-19 Tue 20:34] =>  1:16
    :END:
** jasonbraganza
*** DONE NIOS Maths Text Book - Part I
    CLOSED: [2019-02-28 Thu 23:30]
    :PROPERTIES:
    :ESTIMATED: 50.0
    :ACTUAL:   14.33
    :OWNER: jasonbraganza
    :ID: READ.1548140097
    :TASKID: READ.1548140097
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-22 Fri 15:30]--[2019-02-22 Fri 17:30] =>  2:00
    CLOCK: [2019-02-22 Fri 09:00]--[2019-02-22 Fri 14:30] =>  5:30
    CLOCK: [2019-02-21 Thu 09:00]--[2019-02-21 Thu 15:50] =>  6:50
    :END:
** sandeepk
*** DONE Django Project Optimization [2/2]
    CLOSED: [2019-03-26 Tue 10:30]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:   4.87
    :OWNER: sandeepk
    :ID: READ.1550764743
    :TASKID: READ.1550764743
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-26 Tue 09:40]--[2019-02-26 Tue 10:30] =>  0:50
    CLOCK: [2019-02-25 Mon 23:00]--[2019-02-25 Mon 23:55] =>  0:55
    CLOCK: [2019-02-24 Sun 22:30]--[2019-02-24 Sun 23:30] =>  1:00
    CLOCK: [2019-02-22 Fri 22:50]--[2019-02-22 Fri 23:45] =>  0:55
    CLOCK: [2019-02-21 Thu 22:40]--[2019-02-21 Thu 23:52] =>  1:12
    :END:
    - [X] [[https://dizballanze.com/django-project-optimization-part-1/] [Part 1]] 3h
    - [X] [[https://dizballanze.com/en/django-project-optimization-part-2/] [Part 2]] 2h
*** DONE Blog Writing [2/2]
    CLOSED: [2019-03-23 Sat 15:10]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:   2.33
    :OWNER: sandeepk
    :ID: WRITE.1550819723
    :TASKID: WRITE.1550819723
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-23 Sat 14:00]--[2019-02-23 Sat 15:10] =>  1:10
    CLOCK: [2019-02-20 Wed 08:30]--[2019-02-20 Wed 09:10] =>  0:40
    CLOCK: [2019-02-19 Tue 21:25]--[2019-02-19 Tue 21:55] =>  0:30
    :END:
    - [X] Write blog for Music productivity 1h
    - [X] Write blog for shell script Notes 2h
** nightwarrior-xxx
*** DONE [#A] Understanding the concept of React - Part I [3/3]
    CLOSED: [2019-02-28 Thu 23:45]
         :PROPERTIES:
         :ESTIMATED: 19
         :ACTUAL:   2.92
         :OWNER: nightwarrior-xxx
         :ID: DEV.1550564523
         :TASKID: DEV.1550564523
         :END:
         :LOGBOOK:
         CLOCK: [2019-02-28 Thu 19:23]--[2019-02-28 Thu 19:43] =>  0:20
         CLOCK: [2019-02-25 Mon 20:51]--[2019-02-25 Mon 21:17] =>  0:26
         CLOCK: [2019-02-25 Mon 19:59]--[2019-02-25 Mon 20:51] =>  0:52
         CLOCK: [2019-02-21 Thu 08:26]--[2019-02-21 Thu 08:35] =>  0:09
         CLOCK: [2019-02-21 Thu 06:57]--[2019-02-21 Thu 07:06] =>  0:09
         CLOCK: [2019-02-21 Thu 06:03]--[2019-02-21 Thu 06:55] =>  0:52
         CLOCK: [2019-02-21 Thu 00:20]--[2019-02-21 Thu 00:27] =>  0:07
         :END:
         - [X] Getting Started
         - [X] Refreshing Next Generation JavaScript (Optional)
         - [X] Understanding the Base Features & Syntax

